Revit 2015 API
IFCAnyHandle.SetAttribute Method
Overload List
Name | Description
SetAttribute(String, IFCAnyHandle)
 Sets the attribute value.
SetAttribute(String, IFCData)
 Sets the attribute value.
SetAttribute(String, Boolean)
 Sets the attribute value.
SetAttribute(String, ICollection<IFCAnyHandle>) |  Obsolete.
SetAttribute(String, ICollection<Boolean>) |  Obsolete.
SetAttribute(String, ICollection<Double>) |  Obsolete.
SetAttribute(String, ICollection<Int32>) |  Obsolete.
SetAttribute(String, ICollection<String>) |  Obsolete.
SetAttribute(String, IList<IFCAnyHandle>)
SetAttribute(String, IList<Boolean>)
SetAttribute(String, IList<Double>)
SetAttribute(String, IList<Int32>)
SetAttribute(String, IList<String>)
SetAttribute(String, ISet<IFCAnyHandle>)
SetAttribute(String, ISet<Boolean>)
SetAttribute(String, ISet<Double>)
SetAttribute(String, ISet<Int32>)
SetAttribute(String, ISet<String>)
SetAttribute(String, Double)
 Sets the attribute value.
SetAttribute(String, Int32)
 Sets the attribute value.
SetAttribute(String, String)
 Sets the attribute value.
See Also
IFCAnyHandle Class
IFCAnyHandle Members
Autodesk.Revit.DB.IFC Namespace